MikroElektronika/core_packages/dsPIC/XC16/def/PIC24F08KL302/mcu.h
extern volatile ECCP1ASBITS ECCP1ASbits __attribute__((__sfr__));

#define PSTR1CON PSTR1CON
extern volatile uint16_t PSTR1CON __attribute__((__sfr__));
__extension__ typedef struct tagPSTR1CONBITS {
  union {
    struct {
      uint16_t STRA:1;
      uint16_t STRB:1;
      uint16_t STRC:1;
      uint16_t STRD:1;
      uint16_t STRSYNC:1;
      uint16_t :1;
      uint16_t CMPL:2;
    };
    struct {
      uint16_t :6;
      uint16_t CMPL0:1;
      uint16_t CMPL1:1;
    };
  };
} PSTR1CONBITS;
extern volatile PSTR1CONBITS PSTR1CONbits __attribute__((__sfr__));

#define CCP2CON CCP2CON
extern volatile uint16_t CCP2CON __attribute__((__sfr__));
__extension__ typedef struct tagCCP2CONBITS {
  union {
    struct {
      uint16_t CCPM:4;
      uint16_t DCB:2;
    };
    struct {
      uint16_t CCPM0:1;
      uint16_t CCPM1:1;
      uint16_t CCPM2:1;
      uint16_t CCPM3:1;
      uint16_t DCB0:1;
      uint16_t DCB1:1;
    };
    struct {
      uint16_t CCP2M:4;
      uint16_t DC2B:2;
    };
    struct {
      uint16_t CCP2M0:1;
      uint16_t CCP2M1:1;
      uint16_t CCP2M2:1;
      uint16_t CCP2M3:1;
      uint16_t DC2B0:1;
      uint16_t DC2B1:1;
    };
  };
} CCP2CONBITS;
extern volatile CCP2CONBITS CCP2CONbits __attribute__((__sfr__));

#define CCPR2L CCPR2L
extern volatile uint8_t CCPR2L __attribute__((__sfr__));
#define CCPR2H CCPR2H
extern volatile uint8_t CCPR2H __attribute__((__sfr__));
#define CCP3CON CCP3CON
extern volatile uint16_t CCP3CON __attribute__((__sfr__));
__extension__ typedef struct tagCCP3CONBITS {
  union {
    struct {
      uint16_t CCPM:4;
      uint16_t DCB:2;
    };
    struct {
      uint16_t CCPM0:1;
      uint16_t CCPM1:1;
      uint16_t CCPM2:1;
      uint16_t CCPM3:1;
      uint16_t DCB0:1;
      uint16_t DCB1:1;
    };
    struct {
      uint16_t CCP3M:4;
      uint16_t DC3B:2;
    };
    struct {
      uint16_t CCP3M0:1;
      uint16_t CCP3M1:1;
      uint16_t CCP3M2:1;
      uint16_t CCP3M3:1;
      uint16_t DC3B0:1;
      uint16_t DC3B1:1;
    };
  };
} CCP3CONBITS;
extern volatile CCP3CONBITS CCP3CONbits __attribute__((__sfr__));

#define CCPR3L CCPR3L
extern volatile uint8_t CCPR3L __attribute__((__sfr__));
#define CCPR3H CCPR3H
extern volatile uint8_t CCPR3H __attribute__((__sfr__));
#define SPI1BUF SPI1BUF
extern volatile uint16_t SPI1BUF __attribute__((__sfr__));
__extension__ typedef struct tagSPI1BUFBITS {
  union {
    struct {
      uint16_t SSPBUF:8;
    };
    struct {
      uint16_t SPI1BUF:8;
    };
  };
} SPI1BUFBITS;
extern volatile SPI1BUFBITS SPI1BUFbits __attribute__((__sfr__));

#define SSP1BUF SSP1BUF
extern volatile uint16_t SSP1BUF __attribute__((__sfr__));
__extension__ typedef struct tagSSP1BUFBITS {
  union {
    struct {
      uint16_t SSPBUF:8;
    };
    struct {
      uint16_t SPI1BUF:8;
    };
  };
} SSP1BUFBITS;
extern volatile SSP1BUFBITS SSP1BUFbits __attribute__((__sfr__));

#define SSP1CON1 SSP1CON1
extern volatile uint16_t SSP1CON1 __attribute__((__sfr__));
__extension__ typedef struct tagSSP1CON1BITS {
  union {
    struct {
      uint16_t SSPM:4;
      uint16_t CKP:1;
      uint16_t SSPEN:1;
      uint16_t SSPOV:1;
      uint16_t WCOL:1;
    };
    struct {
      uint16_t SSPM0:1;
      uint16_t SSPM1:1;
      uint16_t SSPM2:1;
      uint16_t SSPM3:1;
    };
  };
} SSP1CON1BITS;
extern volatile SSP1CON1BITS SSP1CON1bits __attribute__((__sfr__));

#define SSP1CON2 SSP1CON2
extern volatile uint16_t SSP1CON2 __attribute__((__sfr__));
__extension__ typedef struct tagSSP1CON2BITS {
  union {
    struct {
      uint16_t SEN:1;
      uint16_t RSEN:1;
      uint16_t PEN:1;
      uint16_t RCEN:1;
      uint16_t ACKEN:1;
      uint16_t ACKDT:1;
      uint16_t ACKSTAT:1;
      uint16_t GCEN:1;
    };
    struct {
      uint16_t :1;
      uint16_t ADMSK:5;
    };
    struct {
      uint16_t :1;
      uint16_t ADMSK1:1;
      uint16_t ADMSK2:1;
      uint16_t ADMSK3:1;
      uint16_t ADMSK4:1;
      uint16_t ADMSK5:1;
    };
  };
} SSP1CON2BITS;
extern volatile SSP1CON2BITS SSP1CON2bits __attribute__((__sfr__));

#define SSP1CON3 SSP1CON3
extern volatile uint16_t SSP1CON3 __attribute__((__sfr__));
typedef struct tagSSP1CON3BITS {
  uint16_t DHEN:1;
  uint16_t AHEN:1;
  uint16_t SBCDE:1;
  uint16_t SDAHT:1;
  uint16_t BOEN:1;
  uint16_t SCIE:1;
  uint16_t PCIE:1;
  uint16_t ACKTIM:1;
} SSP1CON3BITS;
extern volatile SSP1CON3BITS SSP1CON3bits __attribute__((__sfr__));

#define SSP1STAT SSP1STAT
extern volatile uint16_t SSP1STAT __attribute__((__sfr__));
__extension__ typedef struct tagSSP1STATBITS {
  union {
    struct {
      uint16_t BF:1;
      uint16_t UA:1;
      uint16_t R_NOT_W:1;
      uint16_t S:1;
      uint16_t P:1;
      uint16_t D_NOT_A:1;
      uint16_t CKE:1;
      uint16_t SMP:1;
    };
    struct {
      uint16_t :2;
      uint16_t R_W:1;
      uint16_t :2;
      uint16_t D_A:1;
    };
    struct {
      uint16_t :2;
      uint16_t NOT_W:1;
      uint16_t :2;
      uint16_t NOT_A:1;
    };
    struct {
      uint16_t :2;
      uint16_t NOT_WRITE:1;
      uint16_t :2;
      uint16_t NOT_ADDRESS:1;
    };
    struct {
      uint16_t :2;
      uint16_t READ_WRITE:1;
      uint16_t :2;
      uint16_t DATA_ADDRESS:1;
    };
    struct {
      uint16_t :2;
      uint16_t I2C_READ:1;
      uint16_t I2C_START:1;
      uint16_t I2C_STOP:1;
      uint16_t I2C_DAT:1;
    };
  };
} SSP1STATBITS;
extern volatile SSP1STATBITS SSP1STATbits __attribute__((__sfr__));

#define I2C1ADD I2C1ADD
extern volatile uint16_t I2C1ADD __attribute__((__sfr__));
__extension__ typedef struct tagI2C1ADDBITS {
  union {
    struct {
      uint16_t SSPADD:8;
    };
    struct {
      uint16_t I2CADD:8;
    };
  };
} I2C1ADDBITS;
extern volatile I2C1ADDBITS I2C1ADDbits __attribute__((__sfr__));

#define SSP1ADD SSP1ADD
extern volatile uint16_t SSP1ADD __attribute__((__sfr__));
__extension__ typedef struct tagSSP1ADDBITS {
  union {
    struct {
      uint16_t SSPADD:8;
    };
    struct {
      uint16_t I2CADD:8;
    };
  };
} SSP1ADDBITS;
extern volatile SSP1ADDBITS SSP1ADDbits __attribute__((__sfr__));

#define I2C1MSK I2C1MSK
extern volatile uint16_t I2C1MSK __attribute__((__sfr__));
__extension__ typedef struct tagI2C1MSKBITS {
  union {
    struct {
      uint16_t MSK0:1;
      uint16_t MSK1:1;
      uint16_t MSK2:1;
      uint16_t MSK3:1;
      uint16_t MSK4:1;
      uint16_t MSK5:1;
      uint16_t MSK6:1;
      uint16_t MSK7:1;
    };
    struct {
      uint16_t AMSK:8;
    };
  };
} I2C1MSKBITS;
