MikroElektronika/core_packages/dsPIC/XC16/def/PIC24F08KL302/mcu.h
/* CCP1CON */
/* Bitname _CCPM cannot be defined because it is used by more than one SFR */
/* Bitname _DCB cannot be defined because it is used by more than one SFR */
#define _PM CCP1CONbits.PM
/* Bitname _CCPM0 cannot be defined because it is used by more than one SFR */
/* Bitname _CCPM1 cannot be defined because it is used by more than one SFR */
/* Bitname _CCPM2 cannot be defined because it is used by more than one SFR */
/* Bitname _CCPM3 cannot be defined because it is used by more than one SFR */
/* Bitname _DCB0 cannot be defined because it is used by more than one SFR */
/* Bitname _DCB1 cannot be defined because it is used by more than one SFR */
#define _PM0 CCP1CONbits.PM0
#define _PM1 CCP1CONbits.PM1
#define _CCP1M CCP1CONbits.CCP1M
#define _DC1B CCP1CONbits.DC1B
#define _P1M CCP1CONbits.P1M
#define _CCP1M0 CCP1CONbits.CCP1M0
#define _CCP1M1 CCP1CONbits.CCP1M1
#define _CCP1M2 CCP1CONbits.CCP1M2
#define _CCP1M3 CCP1CONbits.CCP1M3
#define _DC1B0 CCP1CONbits.DC1B0
#define _DC1B1 CCP1CONbits.DC1B1
#define _P1M0 CCP1CONbits.P1M0
#define _P1M1 CCP1CONbits.P1M1

/* ECCP1DEL */
#define _PDC ECCP1DELbits.PDC
#define _PRSEN ECCP1DELbits.PRSEN
#define _PDC0 ECCP1DELbits.PDC0
#define _PDC1 ECCP1DELbits.PDC1
#define _PDC2 ECCP1DELbits.PDC2
#define _PDC3 ECCP1DELbits.PDC3
#define _PDC4 ECCP1DELbits.PDC4
#define _PDC5 ECCP1DELbits.PDC5
#define _PDC6 ECCP1DELbits.PDC6
#define _P1DC ECCP1DELbits.P1DC
#define _P1RSEN ECCP1DELbits.P1RSEN
#define _P1DC0 ECCP1DELbits.P1DC0
#define _P1DC1 ECCP1DELbits.P1DC1
#define _P1DC2 ECCP1DELbits.P1DC2
#define _P1DC3 ECCP1DELbits.P1DC3
#define _P1DC4 ECCP1DELbits.P1DC4
#define _P1DC5 ECCP1DELbits.P1DC5
#define _P1DC6 ECCP1DELbits.P1DC6

/* ECCP1AS */
#define _PSSBD ECCP1ASbits.PSSBD
#define _PSSAC ECCP1ASbits.PSSAC
#define _ECCPAS ECCP1ASbits.ECCPAS
#define _ECCPASE ECCP1ASbits.ECCPASE
#define _PSSBD0 ECCP1ASbits.PSSBD0
#define _PSSBD1 ECCP1ASbits.PSSBD1
#define _PSSAC0 ECCP1ASbits.PSSAC0
#define _PSSAC1 ECCP1ASbits.PSSAC1
#define _ECCPAS0 ECCP1ASbits.ECCPAS0
#define _ECCPAS1 ECCP1ASbits.ECCPAS1
#define _ECCPAS2 ECCP1ASbits.ECCPAS2
#define _PSS1BD ECCP1ASbits.PSS1BD
#define _PSS1AC ECCP1ASbits.PSS1AC
#define _ECCP1AS ECCP1ASbits.ECCP1AS
#define _PSS1BD0 ECCP1ASbits.PSS1BD0
#define _PSS1BD1 ECCP1ASbits.PSS1BD1
#define _PSS1AC0 ECCP1ASbits.PSS1AC0
#define _PSS1AC1 ECCP1ASbits.PSS1AC1
#define _ECCP1AS0 ECCP1ASbits.ECCP1AS0
#define _ECCP1AS1 ECCP1ASbits.ECCP1AS1
#define _ECCP1AS2 ECCP1ASbits.ECCP1AS2

/* PSTR1CON */
#define _STRA PSTR1CONbits.STRA
#define _STRB PSTR1CONbits.STRB
#define _STRC PSTR1CONbits.STRC
#define _STRD PSTR1CONbits.STRD
#define _STRSYNC PSTR1CONbits.STRSYNC
#define _CMPL PSTR1CONbits.CMPL
#define _CMPL0 PSTR1CONbits.CMPL0
#define _CMPL1 PSTR1CONbits.CMPL1

/* CCP2CON */
/* Bitname _CCPM cannot be defined because it is used by more than one SFR */
/* Bitname _DCB cannot be defined because it is used by more than one SFR */
/* Bitname _CCPM0 cannot be defined because it is used by more than one SFR */
/* Bitname _CCPM1 cannot be defined because it is used by more than one SFR */
/* Bitname _CCPM2 cannot be defined because it is used by more than one SFR */
/* Bitname _CCPM3 cannot be defined because it is used by more than one SFR */
/* Bitname _DCB0 cannot be defined because it is used by more than one SFR */
/* Bitname _DCB1 cannot be defined because it is used by more than one SFR */
#define _CCP2M CCP2CONbits.CCP2M
#define _DC2B CCP2CONbits.DC2B
#define _CCP2M0 CCP2CONbits.CCP2M0
#define _CCP2M1 CCP2CONbits.CCP2M1
#define _CCP2M2 CCP2CONbits.CCP2M2
#define _CCP2M3 CCP2CONbits.CCP2M3
#define _DC2B0 CCP2CONbits.DC2B0
#define _DC2B1 CCP2CONbits.DC2B1

/* CCP3CON */
/* Bitname _CCPM cannot be defined because it is used by more than one SFR */
/* Bitname _DCB cannot be defined because it is used by more than one SFR */
/* Bitname _CCPM0 cannot be defined because it is used by more than one SFR */
/* Bitname _CCPM1 cannot be defined because it is used by more than one SFR */
/* Bitname _CCPM2 cannot be defined because it is used by more than one SFR */
/* Bitname _CCPM3 cannot be defined because it is used by more than one SFR */
/* Bitname _DCB0 cannot be defined because it is used by more than one SFR */
/* Bitname _DCB1 cannot be defined because it is used by more than one SFR */
#define _CCP3M CCP3CONbits.CCP3M
#define _DC3B CCP3CONbits.DC3B
#define _CCP3M0 CCP3CONbits.CCP3M0
#define _CCP3M1 CCP3CONbits.CCP3M1
#define _CCP3M2 CCP3CONbits.CCP3M2
#define _CCP3M3 CCP3CONbits.CCP3M3
#define _DC3B0 CCP3CONbits.DC3B0
#define _DC3B1 CCP3CONbits.DC3B1

/* SPI1BUF */
/* Bitname _SSPBUF cannot be defined because it is used by more than one SFR */
#define _SPI1BUF SPI1BUFbits.SPI1BUF

/* SSP1CON1 */
/* Bitname _SSPM cannot be defined because it is used by more than one SFR */
/* Bitname _CKP cannot be defined because it is used by more than one SFR */
/* Bitname _SSPEN cannot be defined because it is used by more than one SFR */
/* Bitname _SSPOV cannot be defined because it is used by more than one SFR */
/* Bitname _WCOL cannot be defined because it is used by more than one SFR */
/* Bitname _SSPM0 cannot be defined because it is used by more than one SFR */
/* Bitname _SSPM1 cannot be defined because it is used by more than one SFR */
/* Bitname _SSPM2 cannot be defined because it is used by more than one SFR */
/* Bitname _SSPM3 cannot be defined because it is used by more than one SFR */

/* SSP1CON2 */
/* Bitname _SEN cannot be defined because it is used by more than one SFR */
/* Bitname _RSEN cannot be defined because it is used by more than one SFR */
/* Bitname _PEN cannot be defined because it is used by more than one SFR */
/* Bitname _RCEN cannot be defined because it is used by more than one SFR */
/* Bitname _ACKEN cannot be defined because it is used by more than one SFR */
/* Bitname _ACKDT cannot be defined because it is used by more than one SFR */
/* Bitname _ACKSTAT cannot be defined because it is used by more than one SFR */
/* Bitname _GCEN cannot be defined because it is used by more than one SFR */
/* Bitname _ADMSK cannot be defined because it is used by more than one SFR */
/* Bitname _ADMSK1 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMSK2 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMSK3 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMSK4 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMSK5 cannot be defined because it is used by more than one SFR */

/* SSP1CON3 */
/* Bitname _DHEN cannot be defined because it is used by more than one SFR */
/* Bitname _AHEN cannot be defined because it is used by more than one SFR */
/* Bitname _SBCDE cannot be defined because it is used by more than one SFR */
/* Bitname _SDAHT cannot be defined because it is used by more than one SFR */
/* Bitname _BOEN cannot be defined because it is used by more than one SFR */
/* Bitname _SCIE cannot be defined because it is used by more than one SFR */
/* Bitname _PCIE cannot be defined because it is used by more than one SFR */
/* Bitname _ACKTIM cannot be defined because it is used by more than one SFR */

/* SSP1STAT */
/* Bitname _BF cannot be defined because it is used by more than one SFR */
/* Bitname _UA cannot be defined because it is used by more than one SFR */
/* Bitname _R_NOT_W cannot be defined because it is used by more than one SFR */
/* Bitname _S cannot be defined because it is used by more than one SFR */
/* Bitname _P cannot be defined because it is used by more than one SFR */
/* Bitname _D_NOT_A cannot be defined because it is used by more than one SFR */
/* Bitname _CKE cannot be defined because it is used by more than one SFR */
/* Bitname _SMP cannot be defined because it is used by more than one SFR */
/* Bitname _R_W cannot be defined because it is used by more than one SFR */
/* Bitname _D_A cannot be defined because it is used by more than one SFR */
/* Bitname _NOT_W cannot be defined because it is used by more than one SFR */
/* Bitname _NOT_A cannot be defined because it is used by more than one SFR */
/* Bitname _NOT_WRITE cannot be defined because it is used by more than one SFR */
/* Bitname _NOT_ADDRESS cannot be defined because it is used by more than one SFR */
/* Bitname _READ_WRITE cannot be defined because it is used by more than one SFR */
/* Bitname _DATA_ADDRESS cannot be defined because it is used by more than one SFR */
/* Bitname _I2C_READ cannot be defined because it is used by more than one SFR */
/* Bitname _I2C_START cannot be defined because it is used by more than one SFR */
/* Bitname _I2C_STOP cannot be defined because it is used by more than one SFR */
/* Bitname _I2C_DAT cannot be defined because it is used by more than one SFR */

/* I2C1ADD */
/* Bitname _SSPADD cannot be defined because it is used by more than one SFR */
/* Bitname _I2CADD cannot be defined because it is used by more than one SFR */

/* I2C1MSK */
/* Bitname _MSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _MSK1 cannot be defined because it is used by more than one SFR */
/* Bitname _MSK2 cannot be defined because it is used by more than one SFR */
/* Bitname _MSK3 cannot be defined because it is used by more than one SFR */
/* Bitname _MSK4 cannot be defined because it is used by more than one SFR */
/* Bitname _MSK5 cannot be defined because it is used by more than one SFR */
/* Bitname _MSK6 cannot be defined because it is used by more than one SFR */
/* Bitname _MSK7 cannot be defined because it is used by more than one SFR */
/* Bitname _AMSK cannot be defined because it is used by more than one SFR */

